# Exploring Evaluation Datasets

In [1]:
# Imports
import sqlite3
import pandas as pd
import json
import re
import random
from collections import Counter
from IPython.display import clear_output

import sys
sys.path.insert(0, "../")

from app.backend.processing.process_query.query_pipeline import transform_query
from data.annotation.benchmark_creation import categorize_spider
from utils.query_pattern_recognition import ExtractException, QueryInfo

## WikiSQL

In this notebook we focus at:
* Exploring WikiSQL
* Loading it into a sqlite3 db
* Checking if the query results can be parsed it into single table, single row ToTTo expected format

In [63]:
# Constants
WIKISQL_DB_PATH = "../storage/datasets/wiki_sql/raw/train.db"
WIKISQL_JSON_PATH = "../storage/datasets/wiki_sql/raw/train.tables.jsonl"
QUERIES_PATH = "../storage/datasets/wiki_sql/raw/train.jsonl"

## Reading WikiSQL

In [10]:
def run_query_on_connection():
    pass

def connect_and_query(db_path, query):
    con = sqlite3.connect(db_path)
    cur = con.cursor()

    cur.execute(query)
    res = cur.fetchall()
    con.close()
    
    return res

In [12]:
# Check the table names in the database
print(connect_and_query(WIKISQL_DB_PATH, "SELECT name FROM sqlite_master WHERE type='table';")[:5])

[('table_1_1000181_1',), ('table_1_10006830_1',), ('table_1_10007452_3',), ('table_1_10015132_1',), ('table_1_10015132_14',)]

As we can see the table names have been given a special id. Unfortunately, this leads to lost information that could be used in explaining the query.

In [22]:
def concat_col_names_and_res(res, col_names):
    concatenated = [col_names]
    for row in res:
        concatenated.append(row)
    
    return concatenated

pd.DataFrame(concat_col_names_and_res(*query_with_col_names(WIKISQL_DB_PATH, "SELECT * FROM table_1_10007452_3;")))

,0,1,2,3,4,5
0,col0,col1,col2,col3,col4,col5
1,1992-93,gillig,phantom (high floor),444-464 (21),dd s50egr allison wb-400r,diesel
2,1996,gillig,phantom (high floor),465-467 (3),dd s50 allison wb-400r,diesel
3,1998,gillig,phantom (high floor),468-473 (6),dd s50 allison wb-400r,diesel
4,2000,gillig,advantage (low floor),474-481 (8),cummins isc allison wb-400r,diesel
5,2002,gillig,advantage (low floor),482-492 (11),cummins isl allison wb-400r,diesel
6,2010,nfi,ge40lfr,300-309 (10),ford triton v10 ise-thundervolt tb40-hg,hybrid
7,2011,nfi,c40lfr,310-329 (20),cummins westport isl-g allison wb-400r,cng

In [57]:
class wikiqsl_controller:
    def __init__(self, db_path, tables_path):
        self.db_path = db_path
        
        self.table_info = []
        with open(tables_path) as file_in:
            for line in file_in:
                self.table_info.append(json.loads(line))

    def connect_and_query(self, query):
        con = sqlite3.connect(self.db_path)
        cur = con.cursor()

        cur.execute(query)
        res = cur.fetchall()
        con.close()

        return res
    
    def find_json_table(self, table_id):
        for table in self.table_info:
            if table['id'] == table_id:
                return table
            
    def find_col_names(self, table_id):
        return self.find_json_table(table_id)['header']
    
    def query_with_title(self, query):
        try:
            extracted_table_id = re.search('FROM\stable_(\w*)[\s|;]', query).group(1)
            extracted_table_id = extracted_table_id.replace("_", "-")
        except AttributeError as e:
            raise AttributeError(f"TableId could not be extracted from {query}")
        
        res = self.connect_and_query(query)
        col_names = self.find_col_names(extracted_table_id)
        res.insert(0, tuple(col_names))
        
        return res

In [59]:
wikisql = wikiqsl_controller(WIKISQL_DB_PATH, WIKISQL_JSON_PATH)
pd.DataFrame(wikisql.query_with_title("SELECT * FROM table_1_10007452_3;"))

,0,1,2,3,4,5
0,Order Year,Manufacturer,Model,Fleet Series (Quantity),Powertrain (Engine/Transmission),Fuel Propulsion
1,1992-93,gillig,phantom (high floor),444-464 (21),dd s50egr allison wb-400r,diesel
2,1996,gillig,phantom (high floor),465-467 (3),dd s50 allison wb-400r,diesel
3,1998,gillig,phantom (high floor),468-473 (6),dd s50 allison wb-400r,diesel
4,2000,gillig,advantage (low floor),474-481 (8),cummins isc allison wb-400r,diesel
5,2002,gillig,advantage (low floor),482-492 (11),cummins isl allison wb-400r,diesel
6,2010,nfi,ge40lfr,300-309 (10),ford triton v10 ise-thundervolt tb40-hg,hybrid
7,2011,nfi,c40lfr,310-329 (20),cummins westport isl-g allison wb-400r,cng

## Parsing Queries

In [94]:
def sql_query_creator(table_id, sel_index, agg_index, conditions):
    agg_ops = ['', 'MAX', 'MIN', 'COUNT', 'SUM', 'AVG']
    cond_ops = ['=', '>', '<', 'OP']
    
    table_id = f"table_{table_id.replace('-', '_')}"
    
    rep = f"SELECT {agg_ops[agg_index]}(col{sel_index}) " if agg_index != 0 else f"SELECT col{sel_index} "
    rep += f"FROM {table_id} "

    if conditions:
        rep +=  'WHERE ' + ' AND '.join(['{} {} "{}"'.format('col{}'.format(i), cond_ops[o], v) for i, o, v in conditions])
    return rep

In [64]:
queries = []
with open(QUERIES_PATH) as file_in:
    for line in file_in:
        queries.append(json.loads(line))

In [99]:
json_query = queries[4]
query = sql_query_creator(json_query['table_id'], json_query['sql']['sel'], json_query['sql']['agg'], json_query['sql']['conds'])
print(query, wikisql.query_with_title(query))

SELECT COUNT(col3) FROM table_1_10007452_3 WHERE col5 = "CNG" [('Order Year', 'Manufacturer', 'Model', 'Fleet Series (Quantity)', 'Powertrain (Engine/Transmission)', 'Fuel Propulsion'), (0,)]

## Annotator

In [ ]:
class Annotator:
    def __init__(self, db_path, tables_path, queries_path):
        self.db_path = db_path

## Spider

In [2]:
QUERIES_PATH = "../storage/datasets/spider/original/train_spider.json"
DB_DIR = "../storage/datasets/spider/original/database/"
ANNOTATED_QUERIES_DIR = "../storage/datasets/spider/annotations/queries/"

In [6]:
with open(QUERIES_PATH, 'r') as file:
    queries = json.load(file)

original_queries_numb = len(queries)
# Filter out nested queries
# queries = [q for q in queries if len(q['query'].split('SELECT')) == 2 and 'JOIN' not in q['query']]
queries = [q for q in queries if len(q['query'].split('SELECT')) == 2 and ('time' not in q['query'].lower())]

print(f"Remaining queries: {len(queries)}/{original_queries_numb}\n")
    
for q in random.sample(queries, 5):
    print(f"DB: {q['db_id']}")
    print(f"Query: {q['query']}")
    print(f"Question: {q['question']}")
    print()

Remaining queries: 5933/7000

DB: voter_2
Query: SELECT avg(Age) FROM STUDENT WHERE Sex  =  "F"
Question: What is the average age of female (sex is F) students?

DB: device
Query: SELECT T2.Carrier FROM stock AS T1 JOIN device AS T2 ON T1.Device_ID  =  T2.Device_ID GROUP BY T1.Device_ID HAVING COUNT(*)  >  1
Question: What are the carriers of devices that are in stock in more than a single shop?

DB: cre_Theme_park
Query: SELECT other_hotel_details ,  star_rating_code FROM HOTELS ORDER BY price_range ASC LIMIT 3
Question: Show the details and star ratings of the 3 least expensive hotels.

DB: program_share
Query: SELECT t1.name FROM program AS t1 JOIN broadcast AS t2 ON t1.program_id  =  t2.program_id GROUP BY t2.program_id ORDER BY count(*) DESC LIMIT 1
Question: Which program is broadcast most frequently? Give me the program name.

DB: icfp_1
Query: SELECT fname FROM authors WHERE lname  =  "Ueno"
Question: What is the first name of the author with last name "Ueno"?

In [4]:
def connect_and_query(db_path, query):
    con = sqlite3.connect(db_path)
    
    cur = con.cursor()
    cur.execute(query)
    res = cur.fetchall()
    desc = [d[0] for d in cur.description]
    
    con.close()
    
    return res, desc
    
    
def create_db_path(db_dir, db_id):
    return f"{db_dir}{db_id}/{db_id}.sqlite"


def print_query_info(query, transformed_query, res, cols):
    print()
    print("#" * 120)
    print(f"DB: {query['db_id']}")
    print(f"Original Query: {query['query']}")
    print(f"Transformed Query: {transformed_query}")
    print(f"Question: {query['question']}")
    print()
    display(pd.DataFrame(res, columns=cols))

In [7]:
for ind, q in enumerate(queries):
#     if ind > 5250:
    clear_output(wait=True)
    print(ind, q['query'])
    _, _ = transform_query(q['query'])

5932 SELECT T2.company_name FROM movie AS T1 JOIN culture_company AS T2 ON T1.movie_id  =  T2.movie_id WHERE T1.year  =  1999

In [5]:
last_ind = -1

for q in random.sample(queries, 500):
    clear_output(wait=True)
    try:
        transformed_query, _ = transform_query(q['query'])
    except KeyError:
        raise KeyError(f"Failed to transform {q['query']}")
    transformed_query = transformed_query[:-1] + '3'
    
    res, cols = connect_and_query(
        create_db_path(DB_DIR, q['db_id']),
        transformed_query
    )
    print_query_info(q, transformed_query, res, cols)
    
    
    store_ind = int(input(f"Store results file ind (previous: {last_ind}): "))
    if store_ind == -1:
        continue
    else:
        pd.DataFrame(res, columns=cols).to_csv(f"{ANNOTATED_QUERIES_DIR}q{store_ind}.csv", index=False)
        last_ind = store_ind

########################################################################################################################
DB: club_1
Original Query: SELECT t3.lname FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Bootup Baltimore"
Transformed Query: SELECT t3.lname AS "student lname", t1.clubname AS "club clubname" FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid = t2.clubid JOIN student AS t3 ON t2.stuid = t3.stuid WHERE t1.clubname = 'Bootup Baltimore' LIMIT 3
Question: Find the last names of the members of the club "Bootup Baltimore".

  student lname     club clubname
0         Smith  Bootup Baltimore
1           Lee  Bootup Baltimore

KeyboardInterrupt: Interrupted by user

In [31]:
db_name = "network_2"
query = "SELECT * FROM Person LIMIT 2"

res, cols = connect_and_query(create_db_path(DB_DIR, db_name), query)

pd.DataFrame(res, columns=cols)

    name  age            city  gender       job
0  Alice   25   new york city  female   student
1    Bob   35  salt lake city    male  engineer

In [14]:
queries_sql = [{'query': q['query']} for q in queries]

with open('../tests/resources/spider_queries.json', 'w') as outfile:
    json.dump(queries_sql, outfile)

### Benchmark Analysis

In [5]:
# SPIDER_TRAIN_PATH = "../storage/datasets/spider/original/train_spider.json"
SPIDER_TRAIN_PATH = "../storage/datasets/spider/annotations/annotations_filtered.json"

with open(SPIDER_TRAIN_PATH, 'r') as file:
    train_datapoints = json.load(file)

# categorized_datapoints = categorize_spider(train_datapoints)
categorized_datapoints = train_datapoints

#### Queries per category

In [10]:
categories = [datapoint['category'] for datapoint in categorized_datapoints]
counted_categories = Counter(categories)
counted_categories

Counter({'join_aggregate': 680,
         'join': 884,
         'small_select': 750,
         'aggregate_group_by': 733,
         'aggregate': 719,
         'large_select': 67})

#### Number of JOINs

In [12]:
join_datapoints = [datapoint for datapoint in categorized_datapoints 
                   if datapoint['category'] == 'join']

joins_numb = []

for datapoint in join_datapoints:
    query_info = QueryInfo(datapoint['original_query'])
    joins_numb.append(query_info.joins['num'])
    
counted_joins = Counter(joins_numb)
counted_joins

Counter({1: 591, 2: 261, 3: 27, 4: 5})

#### SELECT size of JOINs

In [14]:
join_datapoints = [datapoint for datapoint in categorized_datapoints 
                   if datapoint['category'] == 'join']

select_sizes = [QueryInfo(datapoint['original_query']).select['columns_num'] for datapoint in join_datapoints]

counted_selects = Counter(select_sizes)
counted_selects

Counter({2: 297, 1: 521, 3: 50, 4: 10, 0: 5, 5: 1})

#### Number of COUNT(*) JOINs

In [18]:
join_datapoints = [datapoint for datapoint in categorized_datapoints 
                   if datapoint['category'] == 'join_aggregate']

queries = [datapoint for datapoint in join_datapoints if 'count(*)' in datapoint['original_query'].split('FROM')[0].lower()]
print(len(queries))

118

In [19]:
for i in queries:
    print(i['original_query'])

SELECT count(*)
 FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id
 WHERE T1.course_name = "English"
SELECT count(*)
 FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid
 WHERE T2.name = "Australian Grand Prix" AND YEAR = 2009
SELECT T1.Product_Name ,  COUNT(*)
 FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID
 GROUP BY T1.Product_Name ORDER BY COUNT(*) DESC
SELECT count(*) ,  T1.name
 FROM airports AS T1 JOIN routes AS T2 ON T1.apid  =  T2.src_apid
 GROUP BY T1.name
SELECT T1.Aircraft ,  COUNT(*)
 FROM aircraft AS T1 JOIN MATCH AS T2 ON T1.Aircraft_ID  =  T2.Winning_Aircraft
 GROUP BY T2.Winning_Aircraft
SELECT COUNT(*)
 FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId
 WHERE T2.Name  =  "Metallica"
SELECT T1.Service_Type_Description ,  T2.Service_Type_Code ,  COUNT(*)
 FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code
 GROUP BY T2.Service_Type_Code
SELECT T1.Product_Name ,  COUNT(*)
 FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID
 GROUP BY T1.Product_Name ORDER BY COUNT(*) DESC
SELECT T2.department_name ,  COUNT(*)
 FROM employees AS T1 JOIN departments AS T2 ON T1.department_id  =  T2.department_id
 GROUP BY T2.department_name
SELECT count(*) ,  T1.blockfloor
 FROM BLOCK AS T1 JOIN room AS T2 ON T1.blockfloor  =  T2.blockfloor AND T1.blockcode  =  T2.blockcode
 GROUP BY T1.blockfloor
SELECT count(*)
 FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  Class_Senator_Vote
 WHERE T1.Sex  =  "M" AND T2.Election_Cycle  =  "Fall"
SELECT T1.County_name ,  COUNT(*)
 FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District
 GROUP BY T1.County_id
SELECT T1.name ,  COUNT(*)
 FROM genres AS T1 JOIN tracks AS T2 ON T2.genre_id  =  T1.id
 GROUP BY T1.id ORDER BY count(*) DESC LIMIT 5;
SELECT T1.County_name ,  COUNT(*)
 FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District
 GROUP BY T1.County_id
SELECT T2.dept_name ,  T2.dept_address ,  count(*)
 FROM student AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code
 GROUP BY T1.dept_code ORDER BY count(*) DESC LIMIT 3
SELECT T3.product_name ,  count(*)
 FROM orders AS T1 JOIN order_items AS T2 JOIN products AS T3 ON T1.order_id = T2.order_id AND T2.product_id = T3.product_id
 GROUP BY T3.product_id
SELECT count(*)
 FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code
 WHERE DEPT_NAME  =  "Accounting"
SELECT count(*)
 FROM Lessons AS T1 JOIN Customers AS T2 ON T1.customer_id  = T2.customer_id
 WHERE T2.first_name = "Ray"
SELECT count(*)
 FROM station AS T1 JOIN trip AS T2 JOIN station AS T3 JOIN trip AS T4 ON T1.id  =  T2.start_station_id AND T2.id  =  T4.id AND T3.id  =  T4.end_station_id
 WHERE T1.city  =  "Mountain View" AND T3.city  =  "Palo Alto"
SELECT count(*)
 FROM city AS T1 JOIN country AS T2 ON T1.country_id  =  T2.country_id
 WHERE T2.country  =  'Australia'
SELECT T1.name ,  count(*)
 FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id
 GROUP BY T1.storm_id
SELECT count(*)
 FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid
 WHERE T1.name  =  'American Airlines'
SELECT count(*)
 FROM salary AS T1 JOIN team AS T2 ON T1.team_id  =  T2.team_id_br
 WHERE T2.name  = 'Boston Red Stockings' AND T1.year  =  2000
SELECT count(*) ,  T1.school_code
 FROM department AS T1 JOIN professor AS T2 ON T1.dept_code  =  T2.dept_code
 GROUP BY T1.school_code
SELECT count(*) ,  T3.school_code
 FROM CLASS AS T1 JOIN course AS T2 ON T1.crs_code  =  T2.crs_code JOIN department AS T3 ON T2.dept_code  =  T3.dept_code
 GROUP BY T3.school_code
SELECT T3.Name ,  COUNT(*)
 FROM employment AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID JOIN company AS T3 ON T1.Company_ID  =  T3.Company_ID
 GROUP BY T3.Name
SELECT count(*)
 FROM routes AS T1 JOIN airports AS T2 ON T1.dst_apid  =  T2.apid JOIN airlines AS T3 ON T1.alid  =  T3.alid
 WHERE T2.country  =  'Italy' AND T3.name  =  'American Airlines'
SELECT count(*) ,  T1.name
 FROM projects AS T1 JOIN assignedto AS T2 ON T1.code  =  T2.project
 WHERE T1.hours  >  300
 GROUP BY T1.name
SELECT t3.headquartered_city ,  count(*)
 FROM store AS t1 JOIN store_district AS t2 ON t1.store_id  =  t2.store_id JOIN district AS t3 ON t2.district_id  =  t3.district_id
 GROUP BY t3.headquartered_city
SELECT T1.Service_Type_Description ,  T2.Service_Type_Code ,  COUNT(*)
 FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code
 GROUP BY T2.Service_Type_Code
SELECT T1.rank ,  count(*)
 FROM Faculty AS T1 JOIN Student AS T2 ON T1.FacID  =  T2.advisor
 GROUP BY T1.rank
SELECT count(*)
 FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code
 WHERE DEPT_NAME  =  "Accounting"
SELECT count(*)
 FROM Lessons AS T1 JOIN Customers AS T2 ON T1.customer_id  = T2.customer_id
 WHERE T2.first_name = "Rylan" AND T2.last_name = "Goodwin" AND T1.lesson_status_code = "Completed";
SELECT count(*)
 FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code
 WHERE T2.dept_name  =  'Accounting' OR T2.dept_name  =  'Biology'
SELECT count(*)
 FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID  =  T2.facID
 WHERE T1.fname  =  "Mark" AND T1.lname  =  "Giuliano"
SELECT COUNT(*)
 FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId
 WHERE T2.Name  =  "Metallica"
SELECT count(*)
 FROM home_game AS T1 JOIN park AS T2 ON T1.park_id  =  T2.park_id
 WHERE T1.year = 1907 AND T2.park_name = 'Columbia Park';
SELECT count(*)
 FROM student AS T1 JOIN lives_in AS T2 ON T1.stuid  =  T2.stuid JOIN dorm AS T3 ON T3.dormid  =  T2.dormid
 WHERE T3.gender  =  'M'
SELECT t1.product_name ,  count(*)
 FROM products AS t1 JOIN complaints AS t2 ON t1.product_id  =  t2.product_id
 GROUP BY t1.product_name
SELECT T1.region_name ,  count(*)
 FROM region AS T1 JOIN affected_region AS T2 ON T1.region_id = T2.region_id
 GROUP BY T1.region_id
SELECT count(*)
 FROM exhibition_record AS T1 JOIN exhibition AS T2 ON T1.exhibition_id  =  T2.exhibition_id
 WHERE T1.attendance  >  100 OR T2.ticket_price  <  10
SELECT T2.Hometown ,  COUNT(*)
 FROM gymnast AS T1 JOIN people AS T2 ON T1.Gymnast_ID  =  T2.People_ID
 GROUP BY T2.Hometown
SELECT avg(T1.salary) ,  count(*)
 FROM instructor AS T1 JOIN department AS T2 ON T1.dept_name  =  T2.dept_name ORDER BY T2.budget DESC
SELECT count(*)
 FROM Ref_Shipping_Agents JOIN Documents ON Documents.shipping_agent_code = Ref_Shipping_Agents.shipping_agent_code
 WHERE Ref_Shipping_Agents.shipping_agent_name = "USPS";
SELECT count(*)
 FROM customers AS T1 JOIN invoices AS T2 ON T1.id = T2.customer_id
 WHERE T1.first_name = "Lucas" AND T1.last_name = "Mancini";
SELECT count(*) ,  T1.blockcode
 FROM BLOCK AS T1 JOIN room AS T2 ON T1.blockfloor  =  T2.blockfloor AND T1.blockcode  =  T2.blockcode
 GROUP BY T1.blockcode
SELECT T2.party_name ,  count(*)
 FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id
 GROUP BY T1.party_id
SELECT count(*)
 FROM employee AS T1 JOIN CLASS AS T2 ON T1.EMP_NUM  =  T2.PROF_NUM
 WHERE T1.EMP_LNAME  =  'Graztevski'
SELECT T1.City_Town ,  count(*)
 FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID
 GROUP BY T1.City_Town
SELECT T2.roomName ,  count(*) ,  T1.Room
 FROM Reservations AS T1 JOIN Rooms AS T2 ON T1.Room  =  T2.RoomId
 GROUP BY T1.Room
SELECT count(*)
 FROM salary AS T1 JOIN team AS T2 ON T1.team_id  =  T2.team_id_br
 WHERE T2.name  = 'Boston Red Stockings' AND T1.year  =  2000
SELECT count(*)
 FROM department_stores AS T1 JOIN department_store_chain AS T2 ON T1.dept_store_chain_id  =  T2.dept_store_chain_id
 WHERE T2.dept_store_chain_name  =  "South"
SELECT count(*) ,  T1.blockcode
 FROM BLOCK AS T1 JOIN room AS T2 ON T1.blockfloor  =  T2.blockfloor AND T1.blockcode  =  T2.blockcode
 GROUP BY T1.blockcode
SELECT avg(T1.salary) ,  count(*)
 FROM instructor AS T1 JOIN department AS T2 ON T1.dept_name  =  T2.dept_name ORDER BY T2.budget DESC
SELECT count(*) ,  T1.name
 FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid
 GROUP BY T1.name
SELECT T2.Name ,  COUNT(*)
 FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID
 GROUP BY T1.Musical_ID
SELECT T2.name ,  count(*)
 FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid
 GROUP BY T1.aid
SELECT count(*)
 FROM Financial_transactions AS T1 JOIN Accounts AS T2 ON T1.account_id  =  T2.account_id
 WHERE T2.account_name  =  "337"
SELECT T2.party_name ,  count(*)
 FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id
 GROUP BY T1.party_id
SELECT department_name ,  COUNT(*)
 FROM employees AS T1 JOIN departments AS T2 ON T1.department_id  =  T2.department_id
 GROUP BY department_name
SELECT count(*) ,  T1.name
 FROM medication AS T1 JOIN prescribes AS T2 ON T1.code = T2.medication
 GROUP BY T1.brand
SELECT T1.name ,  count(*)
 FROM building AS T1 JOIN institution AS T2 ON T1.building_id  =  T2.building_id
 GROUP BY T1.building_id
SELECT T2.Name ,  COUNT(*)
 FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID
 GROUP BY T1.Musical_ID
SELECT T1.name ,  count(*)
 FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id
 GROUP BY T1.storm_id
SELECT t3.headquartered_city ,  count(*)
 FROM store AS t1 JOIN store_district AS t2 ON t1.store_id  =  t2.store_id JOIN district AS t3 ON t2.district_id  =  t3.district_id
 GROUP BY t3.headquartered_city
SELECT count(*) ,  t1.name
 FROM manufacturer AS t1 JOIN furniture_manufacte AS t2 ON t1.manufacturer_id  =  t2.manufacturer_id
 GROUP BY t1.manufacturer_id
SELECT COUNT(*)
 FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId
 WHERE T1.Name  =  "AAC audio file"
SELECT count(*)
 FROM exhibition_record AS T1 JOIN exhibition AS T2 ON T1.exhibition_id  =  T2.exhibition_id
 WHERE T1.attendance  >  100 OR T2.ticket_price  <  10
SELECT count(*) ,  T1.product_name
 FROM product AS T1 JOIN problems AS T2 ON T1.product_id = T2.product_id
 GROUP BY T1.product_name ORDER BY count(*) DESC
SELECT count(*)
 FROM customers AS T1 JOIN invoices AS T2 ON T1.id = T2.customer_id
 WHERE T1.first_name = "Lucas" AND T1.last_name = "Mancini";
SELECT count(*)
 FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id
 WHERE t3.city  =  "Lake Geovannyton"
SELECT T1.course_name ,  COUNT(*)
 FROM Courses AS T1 JOIN Student_Course_Enrolment AS T2 ON T1.course_id  =  T2.course_id
 GROUP BY T1.course_name
SELECT T1.name ,  count(*)
 FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id
 GROUP BY T1.storm_id
SELECT count(*)
 FROM purchase AS T1 JOIN member AS T2 ON T1.member_id  =  T2.member_id
 WHERE T2.level  =  6
SELECT T3.product_name ,  count(*)
 FROM orders AS T1 JOIN order_items AS T2 JOIN products AS T3 ON T1.order_id = T2.order_id AND T2.product_id = T3.product_id
 GROUP BY T3.product_id
SELECT T2.Name ,  COUNT(*)
 FROM repair_assignment AS T1 JOIN technician AS T2 ON T1.technician_ID  =  T2.technician_ID
 GROUP BY T2.Name
SELECT T2.Name ,  COUNT(*)
 FROM debate_people AS T1 JOIN people AS T2 ON T1.Affirmative  =  T2.People_ID
 GROUP BY T2.Name
SELECT T1.part_name ,  count(*)
 FROM Parts AS T1 JOIN Asset_Parts AS T2 ON T1.part_id  =  T2.part_id
 GROUP BY T1.part_name
SELECT count(*)
 FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  Class_Senator_Vote
 WHERE T1.Sex  =  "M" AND T2.Election_Cycle  =  "Fall"
SELECT count(*)
 FROM CLASS AS T1 JOIN enroll AS T2 ON T1.class_code  =  T2.class_code
 WHERE T1.crs_code  =  'ACCT-211'
SELECT T3.Name ,  COUNT(*)
 FROM news_report AS T1 JOIN event AS T2 ON T1.Event_ID  =  T2.Event_ID JOIN journalist AS T3 ON T1.journalist_ID  =  T3.journalist_ID
 GROUP BY T3.Name
SELECT T1.country ,  T1.name ,  count(*)
 FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid
 GROUP BY T1.country ,  T1.name
SELECT T1.County_name ,  COUNT(*)
 FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District
 GROUP BY T1.County_id
SELECT T2.name ,  count(*)
 FROM exhibition AS T1 JOIN artist AS T2 ON T1.artist_id  =  T2.artist_id
 GROUP BY T1.artist_id
SELECT count(*)
 FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id
 WHERE T1.course_name = "English"
SELECT count(*) ,  T1.dormid
 FROM dorm AS T1 JOIN has_amenity AS T2 ON T1.dormid  =  T2.dormid
 WHERE T1.student_capacity  >  100
 GROUP BY T1.dormid
SELECT count(*)
 FROM purchase AS T1 JOIN member AS T2 ON T1.member_id  =  T2.member_id
 WHERE T2.level  =  6
SELECT count(*)
 FROM CLASS AS T1 JOIN enroll AS T2 ON T1.class_code  =  T2.class_code JOIN course AS T3 ON T1.crs_code  =  T3.crs_code JOIN department AS T4 ON T3.dept_code  =  T4.dept_code
 WHERE T4.dept_name  =  'Accounting'
SELECT count(*)
 FROM home_game AS T1 JOIN park AS T2 ON T1.park_id  =  T2.park_id
 WHERE T1.year = 1907 AND T2.park_name = 'Columbia Park';
SELECT t3.headquartered_city ,  count(*)
 FROM store AS t1 JOIN store_district AS t2 ON t1.store_id  =  t2.store_id JOIN district AS t3 ON t2.district_id  =  t3.district_id
 GROUP BY t3.headquartered_city
SELECT count(*)
 FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id
 WHERE T2.customer_first_name  =  "Art" AND T2.customer_last_name  =  "Turcotte"
SELECT count(*)
 FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code
 WHERE DEPT_NAME  =  "Accounting"
SELECT count(*)
 FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id
 WHERE T2.city !=  "San Francisco"
SELECT count(*)
 FROM routes AS T1 JOIN airports AS T2 ON T1.dst_apid  =  T2.apid JOIN airlines AS T3 ON T1.alid  =  T3.alid
 WHERE T2.country  =  'Italy' AND T3.name  =  'American Airlines'
SELECT count(*) ,  T1.name
 FROM medication AS T1 JOIN prescribes AS T2 ON T1.code = T2.medication
 GROUP BY T1.brand
SELECT count(*)
 FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid
 WHERE t3.fname  =  "Linda" AND t3.lname  =  "Smith"
SELECT Country_name ,  COUNT(*)
 FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country
 GROUP BY T1.Country_name
SELECT count(*)
 FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id
 WHERE T2.city !=  "San Francisco"
SELECT count(*)
 FROM airports AS T1 JOIN routes AS T2 ON T1.apid  =  T2.dst_apid
 WHERE T1.name  =  'John F Kennedy International Airport'
SELECT count(*)
 FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code
 WHERE T2.dept_name  =  'Accounting' OR T2.dept_name  =  'Biology'
SELECT T2.department_name ,  COUNT(*)
 FROM employees AS T1 JOIN departments AS T2 ON T1.department_id  =  T2.department_id
 GROUP BY T2.department_name
SELECT T2.Party ,  COUNT(*)
 FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID
 GROUP BY T1.Party
SELECT count(*) ,  T1.name
 FROM scientists AS T1 JOIN assignedto AS T2 ON T1.ssn  =  T2.scientist
 GROUP BY T1.name
SELECT T3.Name ,  COUNT(*)
 FROM news_report AS T1 JOIN event AS T2 ON T1.Event_ID  =  T2.Event_ID JOIN journalist AS T3 ON T1.journalist_ID  =  T3.journalist_ID
 GROUP BY T3.Name
SELECT avg(T1.salary) ,  count(*)
 FROM instructor AS T1 JOIN department AS T2 ON T1.dept_name  =  T2.dept_name ORDER BY T2.budget DESC
SELECT count(*)
 FROM department_stores AS T1 JOIN department_store_chain AS T2 ON T1.dept_store_chain_id  =  T2.dept_store_chain_id
 WHERE T2.dept_store_chain_name  =  "South"
SELECT T1.country ,  T1.name ,  count(*)
 FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid
 GROUP BY T1.country ,  T1.name
SELECT count(*)
 FROM student AS T1 JOIN lives_in AS T2 ON T1.stuid  =  T2.stuid JOIN dorm AS T3 ON T3.dormid  =  T2.dormid
 WHERE T3.gender  =  'M'
SELECT T2.product_name ,  count(*)
 FROM Order_items AS T1 JOIN Products AS T2 ON T1.product_id  =  T2.product_id JOIN Orders AS T3 ON T3.order_id  =  T1.order_id
 GROUP BY T2.product_name
SELECT count(*) ,  T1.year
 FROM postseason AS T1 JOIN team AS T2 ON T1.team_id_winner  =  T2.team_id_br
 WHERE T2.name  =  'Boston Red Stockings'
 GROUP BY T1.year
SELECT count(*)
 FROM airports AS T1 JOIN routes AS T2 ON T1.apid  =  T2.dst_apid
 WHERE T1.name  =  'John F Kennedy International Airport'
SELECT count(*)
 FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid
 WHERE T2.name = "Australian Grand Prix" AND YEAR = 2009
SELECT T2.party_name ,  count(*)
 FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id
 GROUP BY T1.party_id
SELECT count(*)
 FROM airports AS T1 JOIN routes AS T2 ON T1.apid  =  T2.dst_apid
 WHERE country  =  'Canada'
SELECT count(*)
 FROM department_stores AS T1 JOIN department_store_chain AS T2 ON T1.dept_store_chain_id  =  T2.dept_store_chain_id
 WHERE T2.dept_store_chain_name  =  "South"
SELECT count(*) ,  T2.name
 FROM products AS T1 JOIN manufacturers AS T2 ON T1.Manufacturer  =  T2.code
 GROUP BY T2.name
SELECT count(*)
 FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id
 WHERE t1.customer_name  =  "Dayana Robel"
SELECT T1.student_id ,  count(*)
 FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id
 GROUP BY T1.student_id